**`commonimages/components`** terraform plan on `pull_request` event [#221](${url})

```
data.aws_secretsmanager_secret.environment_management: Reading...
data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
aws_imagebuilder_component.this["psreadline_fix.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["aws_cli.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["python_3_6.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["python_3_9.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["powershell_core.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["prometheus_windows_exporter.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["ansible.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["yum_packages.yml"]: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_imagebuilder_component.this["ansible.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.11/1"
        name                  = "ansible"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["aws_cli.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/aws-cli/0.0.3/1"
        name                  = "aws_cli"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["powershell_core.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.3.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: powershell_core
            description: Component to upgrade to using PowerShell Core
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.3.0
          +       default: 0.4.0
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - PowerShellCoreVersion:
                  type: string
          -       default: 7.3.6
          +       default: 7.4.1
                  description: Version of the PowerShell Core to install
            phases:
              - name: build
                steps:
                  - name: InstallPowerShellCore
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          choco install -y chocolatey-core.extension
                          choco install -y kb3118401
                          choco install -y powershell-core --version '{{ PowerShellCoreVersion }}' --install-arguments='"ADD_EXPLORER_CONTEXT_MENU_OPENPOWERSHELL=1 REGISTER_MANIFEST=1 ADD_FILE_CONTEXT_MENU_RUNPOWERSHELL=1 ENABLE_PSREMOTING=1"'
        EOT
      ~ date_created          = "2023-07-20T16:59:47.076Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.3.0/1" -> (known after apply)
        name                  = "powershell_core"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.3.0" -> "0.4.0" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheus-windows-exporter/1.1.7/1"
        name                  = "prometheus_windows_exporter"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["psreadline_fix.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/psreadline-fix/0.0.3/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: psreadline_fix
            description: Component to fix PSReadline not rendering shell in things like Fleet Manager sessions on Windows Server 2022
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.0.3
          +       default: 0.0.4
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: RunPSReadLineModuleInstallForceCommand
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          Install-PackageProvider -Name NuGet -MinimumVersion 2.8.5.201 -Force
            
                          Install-Module -Name PSReadLine -Repository PSGallery -MinimumVersion 2.2.2 -Force -AllowClobber -Confirm:$false
            
                          # delete old versions of Windows PowerShell PSReadline which are the issue
            
          -               $moduleDirectories = Get-ChildItem -Path "C:\Program Files\WindowsPowerShell\Modules\PSReadline" -Directory -Depth 0
          +               $psreadlineModuleDirectories = Get-ChildItem -Path "C:\Program Files\WindowsPowerShell\Modules\PSReadline" -Directory
            
                          foreach ($psreadlineModuleDirectory in $psreadlineModuleDirectories) {
                            $moduleDirectoryPath = $psreadlineModuleDirectory.FullName
          -                 $moduleDirectoryName = $psresdlineModuleDirectory.Name
          +                 $moduleDirectoryName = $psreadlineModuleDirectory.Name
            
                            if ($moduleDirectoryName -le "2.2.2") {
                            Remove-Item -Recurse -Force -Path $moduleDirectoryPath
                            }
                          }
            
          -               $PSReadlineVersion = (Get-Module -ListAvailable PSReadLine).Version.ToString()
          +               $PSReadlineVersion = (Get-Module -ListAvailable PSReadLine).Version
            
                          Write-Host "PSReadline Module Version: $PSReadlineVersion"
        EOT
      ~ date_created          = "2024-01-23T18:16:19.905Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/psreadline-fix/0.0.3/1" -> (known after apply)
        name                  = "psreadline_fix"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.0.3" -> "0.0.4" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["python_3_6.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/python-3-6/0.0.4/1"
        name                  = "python_3_6"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["python_3_9.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/python-3-9/0.0.3/1"
        name                  = "python_3_9"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["yum_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/yum-packages/0.0.1/1"
        name                  = "yum_packages"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "DSO/DSOS-2550/fix-server-2022-ami-psreadline" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "account_to_distribute_ami"
but a value was found in file "terraform.tfvars". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```
